Revit 2027 API
PointOnCurveMeasureFrom Enumeration
 Point on curve MeasureFrom - It tells from which end of the host curve the point location is measured.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PointOnCurveMeasureFrom
Public Enumeration PointOnCurveMeasureFrom
public enum class PointOnCurveMeasureFrom
type PointOnCurveMeasureFrom
Members
Member name | Value | Description
Beginning | 1 |  Beginning of the host curve.
End | 2 |  End of the host curve.
See Also
Reference
Autodesk.Revit.DB Namespace